package pro.sky.telegram_bot_pets_shelter.service;

import org.springframework.stereotype.Service;

/**
 * Данный класс выполняет следующие действия:
 * -ежедневно проверяет базу данных на наличие
 * окончания испытательного срока - считает report для конкретного pet
 * - отправляет через бота - окончание испытательного срока
 * - отправляет через бота - продление испытательного срока
 * - раз в 2 дня проверяет на наличие bad report и помечает как проверенные report
 * - отправляет через бота пользователю, что он "редиска"
 */
@Service
public class VolunteerServiceImp {


}
